In [14]:
import sqlite3
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
connection = sqlite3.connect('my_database2.db')
%load_ext sql
%sql sqlite:///my_database2.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
#asc по возрастанию
#desc по убыванию
%sql SELECT * FROM Provider ORDER BY name DESC

 * sqlite:///my_database2.db
Done.

[(3, 'Компания C'),
 (2, 'Компания B'),
 (1, 'Компания A'),
 (5, 'ИП Петров П.П.'),
 (4, 'ИП Иванов И.И.')]

In [3]:
%%sql 
SELECT * FROM Provider 
WHERE LENGTH(name) == (SELECT MAX(LENGTH(name)) FROM Provider)

 * sqlite:///my_database2.db
Done.

[(4, 'ИП Иванов И.И.'), (5, 'ИП Петров П.П.')]

In [4]:
%%sql
SELECT * FROM Client 
WHERE name LIKE 'К%'

 * sqlite:///my_database2.db
Done.

[(3, 'Козлов Александр', 79011223344, 'пр-т Парковый, д. 8, кв. 2', 'м'),
 (8, 'Кузнецова Анна', 79050005500, 'пр-т Ленина, д. 12, кв. 6', 'ж')]

In [19]:
%%sql
INSERT INTO Client (name, phone, adress, sex) VALUES
('|ованов Петр', 79123456789, 'ул. Центральная, д. 5, кв. 3', 'м');

 * sqlite:///my_database2.db
1 rows affected.

[]

In [25]:
%%sql
SELECT * FROM Client
WHERE name REGEXP '^[ВКЕ]о'

 * sqlite:///my_database2.db
Done.

[(3, 'Козлов Александр', 79011223344, 'пр-т Парковый, д. 8, кв. 2', 'м'),
 (11, 'Вованов Петр', 79123456789, 'ул. Центральная, д. 5, кв. 3', 'м')]

In [29]:
%%sql 
SELECT * FROM Deal

 * sqlite:///my_database2.db
Done.

[(1, '2025-02-05', 1, 1, 1, 5, 10),
 (2, '2025-01-06', 2, 2, 1, 10, 15),
 (3, '2025-01-07', 1, 3, 2, 3, 5),
 (4, '2025-01-08', 3, 4, 3, 8, 12),
 (5, '2025-01-09', 2, 5, 3, 6, 8),
 (6, '2025-01-15', 3, 6, 1, 4, 10),
 (7, '2025-01-20', 1, 7, 3, 7, 15),
 (8, '2025-01-25', 2, 8, 1, 7, 10),
 (9, '2025-01-26', 3, 10, 2, 9, 20),
 (10, '2025-01-28', 1, 10, 2, 11, 25)]

In [31]:
%%sql
INSERT INTO Deal (date, ID_Store, ID_Client, ID_Employee, quantity, discount) VALUES
('2025-03-05', 1, 1, 1, 5, 10);

 * sqlite:///my_database2.db
1 rows affected.

[]

In [32]:
%%sql 
SELECT * FROM Deal 
WHERE strftime("%m", date) == (SELECT strftime("%m", "now")) AND strftime("%Y", date) == (SELECT strftime("%Y", "now"))

 * sqlite:///my_database2.db
Done.

[(11, '2025-03-05', 1, 1, 1, 5, 10)]

In [33]:
%%sql 
SELECT count(*) FROM Deal 
WHERE strftime("%m", date) == (SELECT strftime("%m", "now"))  AND strftime("%Y", date) == (SELECT strftime("%Y", "now"))

 * sqlite:///my_database2.db
Done.

[(1,)]

In [8]:
%%sql
SELECT count(*) FROM Deal
WHERE CAST(strftime("%w", date) AS INTEGER) IN (1,3)

 * sqlite:///my_database2.db
Done.

[(5,)]